---
kind: property
id: P:Autodesk.Revit.DB.ViewDisplayBackground.HorizontalImageScale
source: html/e5c6f41b-f3cd-24fb-87a1-c1eb8d8189e7.htm
---
# Autodesk.Revit.DB.ViewDisplayBackground.HorizontalImageScale Property

The horizontal scale of the background image; the scale of 1.0 puts the image pixel-to-pixel.

## Syntax (C#)
```csharp
public double HorizontalImageScale { get; }
```